Autodesk.Revit.DB.SketchedStairsCurveData.GetCurve
Get a copy of the curve that is formed along this boundary.
Returns:
A copy of the curve.
Since:
2015

Autodesk.Revit.DB.SketchedStairsCurveData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.SketchedStairsCurveData.#ctor(Autodesk.Revit.DB.Curve,System.Double,Autodesk.Revit.DB.Architecture.SketchedCurveSlopeOption)
Construct a SketchedStairsCurveData defined by a curve associated with its height and slope type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.SketchedStairsCurveData
Sketched run/landing curves overrides with height and slope
Since:
2015